<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.intune.FirefoxSignedPkg</string>
	<key>Input</key>
	<dict>
		<key>LATEST_RELEASE</key>
		<string>LATEST_FIREFOX_VERSION</string>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>description</key>
		<string>Mozilla Firefox is a free and open source web browser.</string>
		<key>developer</key>
		<string>Mozilla</string>
		<key>display_name</key>
		<string>Mozilla Firefox</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.stevekueng.intune.FirefoxSignedPkg</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.haircut.processors/AppIconExtractor</key>
			<dict>
				<key>git_hash</key>
				<string>ac703b8003e8d11b0c8a45ea4d1ebe3dda3d9906</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.haircut-recipes/Processors/AppIconExtractor.py</string>
				<key>sha256_hash</key>
				<string>987505b62bd49686796ca4bc5f3339b5c7d75637cc9eca7fb20127d179dcd497</string>
			</dict>
			<key>com.github.stevekueng.processors/IntuneImporter</key>
			<dict>
				<key>git_hash</key>
				<string>db0c7723338d7231e824f81d0fb35a857ce5b17c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.SteveKueng.recipes/IntuneImporter/IntuneImporter.py</string>
				<key>sha256_hash</key>
				<string>3efec4b3fe2f0021864a30db22a6509794582977dff6f6843056b6ff11842449</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.FirefoxSignedPkg</key>
			<dict>
				<key>git_hash</key>
				<string>b8ebd97b7fc92cc4a9dc382ccc2ff8090c1b8f21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/FirefoxSignedPkg.download.recipe</string>
				<key>sha256_hash</key>
				<string>63a854b014f941e7c6a24714eab91310ca0d40b91ab33e609724f24e918be53f</string>
			</dict>
			<key>com.github.stevekueng.intune.FirefoxSignedPkg</key>
			<dict>
				<key>git_hash</key>
				<string>db0c7723338d7231e824f81d0fb35a857ce5b17c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.SteveKueng.recipes/Mozilla/FirefoxSignedPkg.intune.recipe</string>
				<key>sha256_hash</key>
				<string>aa18bfc5f313b565333ed4ba94ea41e228e72955408089e10713930867d63525</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
